tutorials/multiform/equilibriumEulerianFoam/2Dpacking/system/refinement
refmin 0;
refmax 0;
tolmerge 0.00001;
#inputMode merge
