tutorials/multiform/equilibriumEulerianFoam/2Dpacking/system/sampleDict_cloud36
	cloudPoints
	{
		type	cloud;
		axis	xyz;
		points	(
		(0.0164177620493056 0.0164177620493056 0.0164177620493056)
		(0.0164177620493056 0.0164177620493056 0.0492532861479167)
		(0.0164177620493056 0.0164177620493056 0.0820888102465278)
		(0.0164177620493056 0.0164177620493056 0.1149243343451389)
		(0.0164177620493056 0.0164177620493056 0.1477598584437500)
		(0.0164177620493056 0.0164177620493056 0.1805953825423611)
		(0.0164177620493056 0.0164177620493056 0.2134309066409722)
		(0.0164177620493056 0.0164177620493056 0.2462664307395833)
		(0.0164177620493056 0.0164177620493056 0.2791019548381944)
		(0.0164177620493056 0.0164177620493056 0.3119374789368056)
		(0.0164177620493056 0.0164177620493056 0.3447730030354166)
		(0.0164177620493056 0.0164177620493056 0.3776085271340278)
		(0.0164177620493056 0.0164177620493056 0.4104440512326389)
		(0.0164177620493056 0.0164177620493056 0.4432795753312500)
		(0.0164177620493056 0.0164177620493056 0.4761150994298611)
		(0.0164177620493056 0.0164177620493056 0.5089506235284723)
		(0.0164177620493056 0.0164177620493056 0.5417861476270833)
		(0.0164177620493056 0.0164177620493056 0.5746216717256944)
		(0.0164177620493056 0.0164177620493056 0.6074571958243056)
		(0.0164177620493056 0.0164177620493056 0.6402927199229167)
		(0.0164177620493056 0.0164177620493056 0.6731282440215278)
		(0.0164177620493056 0.0164177620493056 0.7059637681201389)
		(0.0164177620493056 0.0164177620493056 0.7387992922187501)
		(0.0164177620493056 0.0164177620493056 0.7716348163173612)
		(0.0164177620493056 0.0164177620493056 0.8044703404159722)
		(0.0164177620493056 0.0164177620493056 0.8373058645145833)
		(0.0164177620493056 0.0164177620493056 0.8701413886131945)
		(0.0164177620493056 0.0164177620493056 0.9029769127118057)
		(0.0164177620493056 0.0164177620493056 0.9358124368104167)
		(0.0164177620493056 0.0164177620493056 0.9686479609090277)
		(0.0164177620493056 0.0164177620493056 1.0014834850076388)
		(0.0164177620493056 0.0164177620493056 1.0343190091062500)
		(0.0164177620493056 0.0164177620493056 1.0671545332048611)
		(0.0164177620493056 0.0164177620493056 1.0999900573034722)
		(0.0164177620493056 0.0164177620493056 1.1328255814020833)
		(0.0164177620493056 0.0164177620493056 1.1656611055006945)
		(0.0164177620493056 0.0492532861479167 0.0164177620493056)
		(0.0164177620493056 0.0492532861479167 0.0492532861479167)
		(0.0164177620493056 0.0492532861479167 0.0820888102465278)
		(0.0164177620493056 0.0492532861479167 0.1149243343451389)
		(0.0164177620493056 0.0492532861479167 0.1477598584437500)
		(0.0164177620493056 0.0492532861479167 0.1805953825423611)
		(0.0164177620493056 0.0492532861479167 0.2134309066409722)
		(0.0164177620493056 0.0492532861479167 0.2462664307395833)
		(0.0164177620493056 0.0492532861479167 0.2791019548381944)
		(0.0164177620493056 0.0492532861479167 0.3119374789368056)
		(0.0164177620493056 0.0492532861479167 0.3447730030354166)
		(0.0164177620493056 0.0492532861479167 0.3776085271340278)
		(0.0164177620493056 0.0492532861479167 0.4104440512326389)
		(0.0164177620493056 0.0492532861479167 0.4432795753312500)
		(0.0164177620493056 0.0492532861479167 0.4761150994298611)
		(0.0164177620493056 0.0492532861479167 0.5089506235284723)
		(0.0164177620493056 0.0492532861479167 0.5417861476270833)
		(0.0164177620493056 0.0492532861479167 0.5746216717256944)
		(0.0164177620493056 0.0492532861479167 0.6074571958243056)
		(0.0164177620493056 0.0492532861479167 0.6402927199229167)
		(0.0164177620493056 0.0492532861479167 0.6731282440215278)
		(0.0164177620493056 0.0492532861479167 0.7059637681201389)
		(0.0164177620493056 0.0492532861479167 0.7387992922187501)
		(0.0164177620493056 0.0492532861479167 0.7716348163173612)
		(0.0164177620493056 0.0492532861479167 0.8044703404159722)
		(0.0164177620493056 0.0492532861479167 0.8373058645145833)
		(0.0164177620493056 0.0492532861479167 0.8701413886131945)
		(0.0164177620493056 0.0492532861479167 0.9029769127118057)
		(0.0164177620493056 0.0492532861479167 0.9358124368104167)
		(0.0164177620493056 0.0492532861479167 0.9686479609090277)
		(0.0164177620493056 0.0492532861479167 1.0014834850076388)
		(0.0164177620493056 0.0492532861479167 1.0343190091062500)
		(0.0164177620493056 0.0492532861479167 1.0671545332048611)
		(0.0164177620493056 0.0492532861479167 1.0999900573034722)
		(0.0164177620493056 0.0492532861479167 1.1328255814020833)
		(0.0164177620493056 0.0492532861479167 1.1656611055006945)
		(0.0164177620493056 0.0820888102465278 0.0164177620493056)
		(0.0164177620493056 0.0820888102465278 0.0492532861479167)
		(0.0164177620493056 0.0820888102465278 0.0820888102465278)
		(0.0164177620493056 0.0820888102465278 0.1149243343451389)
		(0.0164177620493056 0.0820888102465278 0.1477598584437500)
		(0.0164177620493056 0.0820888102465278 0.1805953825423611)
		(0.0164177620493056 0.0820888102465278 0.2134309066409722)
		(0.0164177620493056 0.0820888102465278 0.2462664307395833)
		(0.0164177620493056 0.0820888102465278 0.2791019548381944)
		(0.0164177620493056 0.0820888102465278 0.3119374789368056)
		(0.0164177620493056 0.0820888102465278 0.3447730030354166)
		(0.0164177620493056 0.0820888102465278 0.3776085271340278)
		(0.0164177620493056 0.0820888102465278 0.4104440512326389)
		(0.0164177620493056 0.0820888102465278 0.4432795753312500)
		(0.0164177620493056 0.0820888102465278 0.4761150994298611)
		(0.0164177620493056 0.0820888102465278 0.5089506235284723)
		(0.0164177620493056 0.0820888102465278 0.5417861476270833)
		(0.0164177620493056 0.0820888102465278 0.5746216717256944)
		(0.0164177620493056 0.0820888102465278 0.6074571958243056)
		(0.0164177620493056 0.0820888102465278 0.6402927199229167)
		(0.0164177620493056 0.0820888102465278 0.6731282440215278)
		(0.0164177620493056 0.0820888102465278 0.7059637681201389)
		(0.0164177620493056 0.0820888102465278 0.7387992922187501)
		(0.0164177620493056 0.0820888102465278 0.7716348163173612)
		(0.0164177620493056 0.0820888102465278 0.8044703404159722)
		(0.0164177620493056 0.0820888102465278 0.8373058645145833)
		(0.0164177620493056 0.0820888102465278 0.8701413886131945)
		(0.0164177620493056 0.0820888102465278 0.9029769127118057)
...
);
	}
