tutorials/multiform/equilibriumEulerianFoam/2Dpacking/system/tolerance
tol 1e-8;
#inputMode merge
